MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFE064/mcu.h
#define _ADCSYSCFG1_AN53_POSITION                0x00000015
#define _ADCSYSCFG1_AN53_MASK                    0x00200000
#define _ADCSYSCFG1_AN53_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN54_POSITION                0x00000016
#define _ADCSYSCFG1_AN54_MASK                    0x00400000
#define _ADCSYSCFG1_AN54_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN55_POSITION                0x00000017
#define _ADCSYSCFG1_AN55_MASK                    0x00800000
#define _ADCSYSCFG1_AN55_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN56_POSITION                0x00000018
#define _ADCSYSCFG1_AN56_MASK                    0x01000000
#define _ADCSYSCFG1_AN56_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN57_POSITION                0x00000019
#define _ADCSYSCFG1_AN57_MASK                    0x02000000
#define _ADCSYSCFG1_AN57_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN58_POSITION                0x0000001A
#define _ADCSYSCFG1_AN58_MASK                    0x04000000
#define _ADCSYSCFG1_AN58_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN59_POSITION                0x0000001B
#define _ADCSYSCFG1_AN59_MASK                    0x08000000
#define _ADCSYSCFG1_AN59_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN60_POSITION                0x0000001C
#define _ADCSYSCFG1_AN60_MASK                    0x10000000
#define _ADCSYSCFG1_AN60_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN61_POSITION                0x0000001D
#define _ADCSYSCFG1_AN61_MASK                    0x20000000
#define _ADCSYSCFG1_AN61_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN62_POSITION                0x0000001E
#define _ADCSYSCFG1_AN62_MASK                    0x40000000
#define _ADCSYSCFG1_AN62_LENGTH                  0x00000001

#define _ADCSYSCFG1_AN63_POSITION                0x0000001F
#define _ADCSYSCFG1_AN63_MASK                    0x80000000
#define _ADCSYSCFG1_AN63_LENGTH                  0x00000001

#define _ADCDATA0_DATA_POSITION                  0x00000000
#define _ADCDATA0_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA0_DATA_LENGTH                    0x00000020

#define _ADCDATA1_DATA_POSITION                  0x00000000
#define _ADCDATA1_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA1_DATA_LENGTH                    0x00000020

#define _ADCDATA2_DATA_POSITION                  0x00000000
#define _ADCDATA2_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA2_DATA_LENGTH                    0x00000020

#define _ADCDATA3_DATA_POSITION                  0x00000000
#define _ADCDATA3_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA3_DATA_LENGTH                    0x00000020

#define _ADCDATA4_DATA_POSITION                  0x00000000
#define _ADCDATA4_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA4_DATA_LENGTH                    0x00000020

#define _ADCDATA5_DATA_POSITION                  0x00000000
#define _ADCDATA5_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA5_DATA_LENGTH                    0x00000020

#define _ADCDATA6_DATA_POSITION                  0x00000000
#define _ADCDATA6_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA6_DATA_LENGTH                    0x00000020

#define _ADCDATA7_DATA_POSITION                  0x00000000
#define _ADCDATA7_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA7_DATA_LENGTH                    0x00000020

#define _ADCDATA8_DATA_POSITION                  0x00000000
#define _ADCDATA8_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA8_DATA_LENGTH                    0x00000020

#define _ADCDATA9_DATA_POSITION                  0x00000000
#define _ADCDATA9_DATA_MASK                      0xFFFFFFFF
#define _ADCDATA9_DATA_LENGTH                    0x00000020

#define _ADCDATA10_DATA_POSITION                 0x00000000
#define _ADCDATA10_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA10_DATA_LENGTH                   0x00000020

#define _ADCDATA11_DATA_POSITION                 0x00000000
#define _ADCDATA11_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA11_DATA_LENGTH                   0x00000020

#define _ADCDATA12_DATA_POSITION                 0x00000000
#define _ADCDATA12_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA12_DATA_LENGTH                   0x00000020

#define _ADCDATA13_DATA_POSITION                 0x00000000
#define _ADCDATA13_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA13_DATA_LENGTH                   0x00000020

#define _ADCDATA14_DATA_POSITION                 0x00000000
#define _ADCDATA14_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA14_DATA_LENGTH                   0x00000020

#define _ADCDATA15_DATA_POSITION                 0x00000000
#define _ADCDATA15_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA15_DATA_LENGTH                   0x00000020

#define _ADCDATA16_DATA_POSITION                 0x00000000
#define _ADCDATA16_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA16_DATA_LENGTH                   0x00000020

#define _ADCDATA17_DATA_POSITION                 0x00000000
#define _ADCDATA17_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA17_DATA_LENGTH                   0x00000020

#define _ADCDATA18_DATA_POSITION                 0x00000000
#define _ADCDATA18_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA18_DATA_LENGTH                   0x00000020

#define _ADCDATA43_DATA_POSITION                 0x00000000
#define _ADCDATA43_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA43_DATA_LENGTH                   0x00000020

#define _ADCDATA44_DATA_POSITION                 0x00000000
#define _ADCDATA44_DATA_MASK                     0xFFFFFFFF
#define _ADCDATA44_DATA_LENGTH                   0x00000020

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM1CON_CCH0_POSITION                    0x00000000
#define _CM1CON_CCH0_MASK                        0x00000001
#define _CM1CON_CCH0_LENGTH                      0x00000001

#define _CM1CON_CCH1_POSITION                    0x00000001
#define _CM1CON_CCH1_MASK                        0x00000002
#define _CM1CON_CCH1_LENGTH                      0x00000001

#define _CM1CON_EVPOL0_POSITION                  0x00000006
#define _CM1CON_EVPOL0_MASK                      0x00000040
#define _CM1CON_EVPOL0_LENGTH                    0x00000001

#define _CM1CON_EVPOL1_POSITION                  0x00000007
#define _CM1CON_EVPOL1_MASK                      0x00000080
#define _CM1CON_EVPOL1_LENGTH                    0x00000001

